In [1]:
from typing import List
import pandas as pd

Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.
Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.

In [2]:
data_path = '../mortality/mortality.csv'

In [3]:
mortality_data = pd.read_csv(data_path)

In [4]:
mortality_data.head()

   Year  Age Group  Death Rate
0  1900  1-4 Years      1983.8
1  1901  1-4 Years      1695.0
2  1902  1-4 Years      1655.7
3  1903  1-4 Years      1542.1
4  1904  1-4 Years      1591.5

In [5]:
#DataFrame constructor
df_data : List[List[str | int | float]] = [[1900, '1-4 years', 1983.8],
                                          [1901, '1-4 years', 1695.0]]
df_columns : List[str] = ['Year', 'Age Group', 'Death Rate']

In [6]:
import pandas as pd

mortality_df = pd.DataFrame(
    data=df_data,
    columns=df_columns
)

In [7]:
mortality_df

   Year  Age Group  Death Rate
0  1900  1-4 years      1983.8
1  1901  1-4 years      1695.0

In [8]:
mortality_data.to_pickle('mortality_data.pkl')

In [9]:
mortality_data = pd.read_pickle('mortality_data.pkl')

In [10]:
#display the data
#JupyterLab automatically displays the contents of a named DataFrame
mortality_data

     Year    Age Group  Death Rate
0    1900    1-4 Years      1983.8
1    1901    1-4 Years      1695.0
2    1902    1-4 Years      1655.7
3    1903    1-4 Years      1542.1
4    1904    1-4 Years      1591.5
..    ...          ...         ...
467  2013  15-19 Years        44.8
468  2014  15-19 Years        45.5
469  2015  15-19 Years        48.3
470  2016  15-19 Years        51.2
471  2017  15-19 Years        51.5

[472 rows x 3 columns]

In [11]:
mortality_data.head()

   Year  Age Group  Death Rate
0  1900  1-4 Years      1983.8
1  1901  1-4 Years      1695.0
2  1902  1-4 Years      1655.7
3  1903  1-4 Years      1542.1
4  1904  1-4 Years      1591.5

In [12]:
mortality_data.head(n=5)

   Year  Age Group  Death Rate
0  1900  1-4 Years      1983.8
1  1901  1-4 Years      1695.0
2  1902  1-4 Years      1655.7
3  1903  1-4 Years      1542.1
4  1904  1-4 Years      1591.5

In [13]:
(mortality_data.head(n=5) == mortality_data.head()).all()

Year          True
Age Group     True
Death Rate    True
dtype: bool

In [14]:
(mortality_data.head(n=5) != mortality_data.head()).all() #the opposite of the above

Year          False
Age Group     False
Death Rate    False
dtype: bool

In [15]:
mortality_data.tail()

     Year    Age Group  Death Rate
467  2013  15-19 Years        44.8
468  2014  15-19 Years        45.5
469  2015  15-19 Years        48.3
470  2016  15-19 Years        51.2
471  2017  15-19 Years        51.5

In [16]:
mortality_data.tail(n=4)

     Year    Age Group  Death Rate
468  2014  15-19 Years        45.5
469  2015  15-19 Years        48.3
470  2016  15-19 Years        51.2
471  2017  15-19 Years        51.5

In [17]:
#display the last three rows
mortality_data.tail(n=3)

     Year    Age Group  Death Rate
469  2015  15-19 Years        48.3
470  2016  15-19 Years        51.2
471  2017  15-19 Years        51.5

In [18]:
#how to display the data in 5 rows and all columns
with pd.option_context(
    'display.max_rows', 5,
    'display.max_columns', None
):
    display(mortality_data)

     Year    Age Group  Death Rate
0    1900    1-4 Years      1983.8
1    1901    1-4 Years      1695.0
..    ...          ...         ...
470  2016  15-19 Years        51.2
471  2017  15-19 Years        51.5

[472 rows x 3 columns]

In [19]:
#display the first three rows and the first two columns
with pd.option_context(
    'display.max_rows', 3,
    'display.max_columns', 2
):
    display(mortality_data) #notice how the columns are missing

     Year  ... Death Rate
0    1900  ...     1983.8
..    ...  ...        ...
471  2017  ...       51.5

[472 rows x 3 columns]

In [20]:
mortality_data.values

array([[1900, '1-4 Years', 1983.8],
       [1901, '1-4 Years', 1695.0],
       [1902, '1-4 Years', 1655.7],
       ...,
       [2015, '15-19 Years', 48.3],
       [2016, '15-19 Years', 51.2],
       [2017, '15-19 Years', 51.5]], dtype=object)

In [21]:
print('Index: ', mortality_data.index)
print('Columns: ', mortality_data.columns)
print('Size: ', mortality_data.size)
print('Shape: ', mortality_data.shape)

Index:  RangeIndex(start=0, stop=472, step=1)
Columns:  Index(['Year', 'Age Group', 'Death Rate'], dtype='object')
Size:  1416
Shape:  (472, 3)

In [22]:
mortality_data.columns

Index(['Year', 'Age Group', 'Death Rate'], dtype='object')

In [23]:
mortality_data.columns.str.replace(' ', '')

Index(['Year', 'AgeGroup', 'DeathRate'], dtype='object')

In [24]:
mortality_data.columns = mortality_data.columns.str.replace(' ', '')

In [25]:
mortality_data.columns #New index

Index(['Year', 'AgeGroup', 'DeathRate'], dtype='object')

In [26]:
mortality_data.query('Year == 1900')

     Year     AgeGroup  DeathRate
0    1900    1-4 Years     1983.8
118  1900    5-9 Years      466.1
236  1900  10-14 Years      298.3
354  1900  15-19 Years      484.8

In [27]:
cond = mortality_data['Year'] == 1900
mortality_data[cond]

     Year     AgeGroup  DeathRate
0    1900    1-4 Years     1983.8
118  1900    5-9 Years      466.1
236  1900  10-14 Years      298.3
354  1900  15-19 Years      484.8

In [28]:
cond = mortality_data['Year'] == 1900
try:
    mortality_data.query(cond)
except ValueError as e:
    print(e)

expr must be a string to be evaluated, <class 'pandas.core.series.Series'> given

In [31]:
#based on multiple columns with the and operator
mortality_data.query('Year == 1900 and AgeGroup != "1-4 Years"')

     Year     AgeGroup  DeathRate
118  1900    5-9 Years      466.1
236  1900  10-14 Years      298.3
354  1900  15-19 Years      484.8

In [33]:
#based on multiple columns with the or operator
mortality_data.query('Year == 1900 or Year == 2000')

     Year     AgeGroup  DeathRate
0    1900    1-4 Years     1983.8
100  2000    1-4 Years       32.4
118  1900    5-9 Years      466.1
218  2000    5-9 Years       15.8
236  1900  10-14 Years      298.3
336  2000  10-14 Years       20.3
354  1900  15-19 Years      484.8
454  2000  15-19 Years       67.1

In [34]:
mortality_data.query('Year == 1900 or Year == 2000').head()

     Year     AgeGroup  DeathRate
0    1900    1-4 Years     1983.8
100  2000    1-4 Years       32.4
118  1900    5-9 Years      466.1
218  2000    5-9 Years       15.8
236  1900  10-14 Years      298.3

In [37]:
#set two conditions for the data
mortality_data.query('Year == 1900 or Year == 2000').head(n=5)

     Year     AgeGroup  DeathRate
0    1900    1-4 Years     1983.8
100  2000    1-4 Years       32.4
118  1900    5-9 Years      466.1
218  2000    5-9 Years       15.8
236  1900  10-14 Years      298.3

In [38]:
mortality_data.query('Year == 1900 or Year == 2000').head(n=3)

     Year   AgeGroup  DeathRate
0    1900  1-4 Years     1983.8
100  2000  1-4 Years       32.4
118  1900  5-9 Years      466.1

In [41]:
#backticks for column names that contain spaces
mortality_data.query('Year == 2000 and `AgeGroup` != "1-4 Years"')

     Year     AgeGroup  DeathRate
218  2000    5-9 Years       15.8
336  2000  10-14 Years       20.3
454  2000  15-19 Years       67.1

In [46]:
#Remove column names with spaces, so we do not have to use backticks. Backticks work like below.
year = 2000
agegroup = "1-4 Years"
mortality_data.query(f'Year == {year} and `AgeGroup` != "{agegroup}"')

     Year     AgeGroup  DeathRate
218  2000    5-9 Years       15.8
336  2000  10-14 Years       20.3
454  2000  15-19 Years       67.1